tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mrkai77/cask"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "ncurses"
brew "readline"
brew "bash"
brew "cowsay"
brew "fastfetch"
brew "fd"
brew "openssl@3"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "fnm"
brew "fzf"
brew "git"
brew "graphviz"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "lf"
brew "liquibase"
brew "llvm"
brew "lua"
brew "man-db"
brew "mdp"
brew "neovim"
brew "pidof"
brew "pkgconf"
brew "poppler"
brew "portaudio"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rbenv"
brew "ripgrep"
brew "sbcl"
brew "sevenzip"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "wireguard-tools"
brew "yazi"
brew "zlib"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans-extra-condensed"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "git-credential-manager"
cask "hammerspoon"
cask "keycastr"
cask "loop"
cask "orbstack"
cask "reqable"
cask "sioyek"
cask "squirrel-app"
cask "stats"
cask "wezterm"
cask "windterm"
cask "x2goclient"
cask "youtube-downloader"
vscode "aaron-bond.better-comments"
vscode "alexisvt.flutter-snippets"
vscode "antfu.file-nesting"
vscode "antfu.goto-alias"
vscode "antfu.slidev"
vscode "batisteo.vscode-django"
vscode "bierner.comment-tagged-templates"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fastify.fastify-snippets"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hediet.vscode-drawio"
vscode "hollowtree.vue-snippets"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "james-yu.latex-workshop"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jetbrains.jetbrains-ai-assistant"
vscode "kevinrose.vsc-python-indent"
vscode "mattn.lisp"
vscode "michelemelluso.code-beautifier"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "msjsdiag.vscode-react-native"
vscode "njpwerner.autodocstring"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sdras.vue-vscode-snippets"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "steoates.autoimport"
vscode "sumneko.lua"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.quokka-vscode"
vscode "wscats.vue"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
